STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialPort_Client/STM32_WPAN/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "log_module.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble_core.h"
#include "uuid.h"
#include "ble_conf.h"
#include "svc_ctl.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "app_conf.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wbaxx_nucleo.h"
#include "serial_cmd_interpreter.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */
  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef enum
{
  SVC_ID_GAP = 0,
  SVC_ID_GATT,
  /* USER CODE BEGIN svcId_t */
  /* Serial Port Client*/
  SVC_ID_SPC,
  /* USER CODE END svcId_t */
  SVC_ID_MAX
}svcId_t;

typedef enum
{
  SVC_INFO_STATUS_EMPTY = 0,
  SVC_INFO_STATUS_FOUND,
  SVC_INFO_STATUS_DISCOVERED,
  SVC_INFO_STATUS_ERROR,
  /* USER CODE BEGIN svcInfoStatus_t */
  /* USER CODE END svcInfoStatus_t */
  SVC_INFO_STATUS_MAX
}svcInfoStatus_t;

typedef struct
{
  uint16_t uuid;

  uint16_t charStartHdl;
  uint16_t charEndHdl;
  uint16_t descStartHdl;
  uint16_t descEndHdl;

  svcInfoStatus_t status;
  uint8_t findIncludedServices; /* Set to TRUE to search for included services */
  /* USER CODE BEGIN SvcInfo_t */
  /* USER CODE END SvcInfo_t */

}SvcInfo_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;
  uint16_t connHdl;
  uint16_t att_mtu;

  SvcInfo_t svcInfo[SVC_ID_MAX];

  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;
  uint8_t ServiceChangedCharProperties;
  /* USER CODE BEGIN BleClientAppContext_t */
  /* SVC_ID_SPC Serial Port Client characteristics handle */
  /* handles of the SerialPort service */
  uint16_t SPCServiceHdl;
  uint16_t SPCServiceEndHdl;

  /* handles of the Tx characteristic - Write To Server */
  uint16_t SPCWriteToServerCharHdl;
  uint16_t SPCWriteToServerValueHdl;
  uint16_t SPCWriteToServerDescHdl;

  /* handles of the Rx characteristic - Notification From Server */
  uint16_t SPCNotificationCharHdl;
  uint16_t SPCNotificationValueHdl;
  uint16_t SPCNotificationDescHdl;

  /* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

typedef enum
{
  PROC_GATT_EXCHANGE_CONFIG,
  PROC_GATT_DISC_ALL_PRIMARY_SERVICES,
  PROC_GATT_FIND_INCLUDED_SERVICES,
  PROC_GATT_DISC_ALL_CHARS,
  PROC_GATT_DISC_ALL_DESCS,
  PROC_GATT_PROPERTIES_ENABLE_ALL,
  /* USER CODE BEGIN ProcGattId_t */

  /* USER CODE END ProcGattId_t */
}ProcGattId_t;

/* Context for the current GATT procedure. One procedure at a time is supported. */
typedef struct
{
  ProcGattId_t current_gatt_proc;
  uint8_t att_error_code;
  uint8_t gatt_error_code;
  uint16_t read_char_len;
  uint8_t read_char[512];
  uint16_t read_char_offset;
}BleClientAppProcContext_t;

/* Private defines ------------------------------------------------------------*/
#define BLE_DEFAULT_ATT_MTU                                                   23
/* USER CODE BEGIN PD */
#define BUFFUARTRX_SIZE         20
#define BUFFCOCTX_SIZE          BUFFUARTRX_SIZE
/* Added uint16_t uuid for matching current available service and characteristics discovery framework (only uint16_t uuid are supported) */
#define SPC_SERVICE_UUID                0xF2E0
#define ST_SPC_TX_CHAR_UUID             0xF2E1
#define ST_SPC_RX_CHAR_UUID             0xF2E2

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[CFG_BLE_NUM_CLIENT_CONTEXTS];
static BleClientAppProcContext_t procClientContext;

/* USER CODE BEGIN PV */
uint16_t st_spc_tx_handle;
uint16_t rx_handle;
static uint8_t a_buffUartRx[BUFFUARTRX_SIZE];
static uint8_t buffUartRxIndex;
static uint8_t a_buffUartRxValid[BUFFUARTRX_SIZE];
static uint8_t buffUartRxValidIndex;
static uint8_t a_buffSpTx[BUFFCOCTX_SIZE];
static uint8_t buffSpTxLen;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
static void gatt_parse_services(aci_att_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_included_serv(aci_att_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_find_info_resp_event_rp0 *p_evt);
static int gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt);
static int gatt_parse_indication(aci_gatt_indication_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_task(void);
static void gatt_cmd_resp_release(void);
static uint8_t gatt_cmd_resp_wait(void);
static uint8_t gatt_procedure(uint8_t index, ProcGattId_t GattProcId);
/* USER CODE BEGIN PFP */
static void SPCclient_write_char(void);
void My_Log_Module_Print(Log_Verbose_Level_t VerboseLevel, Log_Region_t Region, const char * Text, ...);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index =0, svcIndex=0;
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */

  /* USER CODE END GATT_CLIENT_APP_Init_1 */
  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    /* USER CODE BEGIN GATT_CLIENT_APP_Init_5 */

