STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialPort_Client/STM32_WPAN/App/gatt_client_app.c
    /* USER CODE END GATT_CLIENT_APP_Init_5 */

    a_ClientContext[index].connHdl = 0xFFFF;
    a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;

    for(svcIndex = 0; svcIndex < SVC_ID_MAX; svcIndex++)
    {
      a_ClientContext[index].svcInfo[svcIndex].uuid = 0;
      a_ClientContext[index].svcInfo[svcIndex].charStartHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].charEndHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].descStartHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].descEndHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].status = SVC_INFO_STATUS_EMPTY;
      /* USER CODE BEGIN GATT_CLIENT_APP_Init_3 */
      a_ClientContext[index].connHdl = 0;
      /* USER CODE END GATT_CLIENT_APP_Init_3 */
    }

    a_ClientContext[index].svcInfo[SVC_ID_GAP].uuid  = GAP_SERVICE_UUID;
    a_ClientContext[index].svcInfo[SVC_ID_GATT].uuid = GATT_SERVICE_UUID;
    /* USER CODE BEGIN GATT_CLIENT_APP_Init_4 */
    a_ClientContext[index].svcInfo[SVC_ID_SPC].uuid  = SPC_SERVICE_UUID;

    /* USER CODE END GATT_CLIENT_APP_Init_4 */
  }

  /* Register the event handler to the BLE controller */
  SVCCTL_RegisterCltHandler(Event_Handler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_task);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */
  UTIL_SEQ_RegTask(1U << CFG_TASK_WRITE_RX_CHAR_ID, UTIL_SEQ_RFU, SPCclient_write_char);

  LOG_INFO_APP("-- SERIAL PORT CLIENT INITIALIZED \n");

  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

    case PEER_CONN_HANDLE_EVT :
    {
      uint8_t index;

      for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
      {
        if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCONNECTED)
        {
          /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_1 */

          /* USER CODE END PEER_CONN_HANDLE_EVT_1 */

          a_ClientContext[index].connHdl = p_Notif->ConnHdl;
          a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
          a_ClientContext[index].att_mtu = BLE_DEFAULT_ATT_MTU;

          /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_2 */

          /* USER CODE END PEER_CONN_HANDLE_EVT_2 */

          break;
        }
      }
      if(index == CFG_BLE_NUM_CLIENT_CONTEXTS)
      {
        LOG_ERROR_APP("Error: reached maximum number of connected servers!\n");
        /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_3 */

        /* USER CODE END PEER_CONN_HANDLE_EVT_3 */
      }
    }
    break;

    case PEER_DISCON_HANDLE_EVT :
    {
      for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
      {
        if(a_ClientContext[index].connHdl == p_Notif->ConnHdl)
        {
          /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT_1 */

          /* USER CODE END PEER_DISCON_HANDLE_EVT_1 */

          a_ClientContext[index].connHdl = 0xFFFF;
          a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;

          /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT_2 */

          /* USER CODE END PEER_DISCON_HANDLE_EVT_2 */

          break;
        }
      }
    }
    break;

    default:
    /* USER CODE BEGIN ConnOpcode_Default */

    /* USER CODE END ConnOpcode_Default */
    break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

/* Deprecated */
uint8_t GATT_CLIENT_APP_Set_Conn_Handle(uint8_t index, uint16_t connHdl)
{
  uint8_t ret;

  if (index < CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    a_ClientContext[index].connHdl = connHdl;
    a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
    ret = 0;
  }
  else
  {
    ret = 1;
  }

  return ret;
}

int GATT_CLIENT_APP_Get_Index(uint16_t connHdl)
{
  uint8_t index;

  if(connHdl > 0x0EFF)
  {
    return -1;
  }

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == connHdl)
    {
      return index;
    }
  }

  return -1;
}

uint8_t GATT_CLIENT_APP_Get_State(uint8_t index)
{
  return a_ClientContext[index].state;
}

void GATT_CLIENT_APP_DiscoverServices(uint16_t connection_handle, uint8_t start_task)
{
  for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].connHdl == connection_handle)
    {
      /* USER CODE BEGIN GATT_CLIENT_APP_Discover_services_1 */

      /* USER CODE END GATT_CLIENT_APP_Discover_services_1 */
      if(start_task)
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

        UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      }
      else
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

        GATT_CLIENT_APP_DiscoverServicesWithIndex(index);
      }

      /* USER CODE BEGIN GATT_CLIENT_APP_Discover_services_2 */

      /* USER CODE END GATT_CLIENT_APP_Discover_services_2 */

      break;
    }
  }

  return;
}

void GATT_CLIENT_APP_DiscoverServicesWithIndex(uint8_t index)
{
  gatt_procedure(index, PROC_GATT_EXCHANGE_CONFIG);
  gatt_procedure(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
  gatt_procedure(index, PROC_GATT_FIND_INCLUDED_SERVICES);
  gatt_procedure(index, PROC_GATT_DISC_ALL_CHARS);
  gatt_procedure(index, PROC_GATT_DISC_ALL_DESCS);
  gatt_procedure(index, PROC_GATT_PROPERTIES_ENABLE_ALL);
}

/* USER CODE BEGIN FD */
uint8_t compare_array(uint8_t *X, uint8_t *Y, uint8_t dim)
{
  uint8_t isEqual=1;

  for(uint8_t i=0; i<dim && isEqual; i++)
  {
    if (X[i] != Y[i])
        isEqual=0;
  }

  return isEqual;
}

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

 static uint8_t gatt_procedure(uint8_t index, ProcGattId_t GattProcId)
{
  uint16_t svcIdx;
  tBleStatus bleStatus = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    status = 1;
  }
  else
  {
    status = 0;

    UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

