STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialPort_Client/STM32_WPAN/App/gatt_client_app.c
  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_2 */

  return procClientContext.gatt_error_code;
}

/* USER CODE BEGIN LF */

static void RxUART_ValidProcess(uint8_t data)
{
  if(buffUartRxValidIndex < sizeof(a_buffUartRxValid))
  {
    a_buffUartRxValid[buffUartRxValidIndex++] = data;

    if(data == '\r')
    {
      a_buffUartRxValid[buffUartRxValidIndex-1] = '\0';
      Serial_CMD_Interpreter_CmdExecute( a_buffUartRxValid, buffUartRxValidIndex );
      buffUartRxValidIndex = 0;
    }
  }
  else
  {
    buffUartRxValidIndex = 0;
  }

  return;
}

void UartRxCpltCallback(uint8_t * pdata, uint16_t size)
{
  uint8_t byte_received;

  if(size == 1)
  {
    byte_received = pdata[0];

    RxUART_ValidProcess(byte_received);

    if(buffUartRxIndex < sizeof(a_buffUartRx))
    {
      a_buffUartRx[buffUartRxIndex++] = byte_received;
    }
    else
    {
      buffUartRxIndex = 0;
    }

    if( (byte_received == '\n') || (buffUartRxIndex >= sizeof(a_buffUartRx)))
    {
      memcpy(&a_buffSpTx[0], &a_buffUartRx[0], buffUartRxIndex);   
      buffSpTxLen = buffUartRxIndex;

      buffUartRxIndex = 0;
      UTIL_SEQ_SetTask(1 << CFG_TASK_WRITE_RX_CHAR_ID, CFG_SEQ_PRIO_0);
    }
  }
  else
  {

  }

  return;
 }

static void SPCclient_write_char(void)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if (a_ClientContext[index].connHdl != 0xFFFF)
    {
      if(a_ClientContext[index].SPCWriteToServerValueHdl != 0)
      {
        // Log the data to be sent
        My_Log_Module_Print(LOG_VERBOSE_INFO, LOG_REGION_APP, "Sending data: ");
        for (uint16_t i = 0; i < buffSpTxLen; i++)
        {
          My_Log_Module_Print(LOG_VERBOSE_INFO, LOG_REGION_APP, "%c", a_buffSpTx[i]);
        }
        My_Log_Module_Print(LOG_VERBOSE_INFO, LOG_REGION_APP, "\n");

        ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                          a_ClientContext[index].SPCWriteToServerValueHdl,
                                          buffSpTxLen,
                                          (const uint8_t *)&a_buffSpTx);

        if (ret != BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X, result: 0x%02X\n",
                        a_ClientContext[index].connHdl,
                        a_ClientContext[index].SPCWriteToServerValueHdl,
                        ret);
        }
      }
      else
      {
        LOG_INFO_APP("ERROR  - SPCclient_write_char - a_ClientContext[0x%02X].SPCWriteToServerValueHdl = 0x%04X\n", index, a_ClientContext[index].SPCWriteToServerValueHdl);
      }
    }
  }

  return;
}

void My_Log_Module_Print(Log_Verbose_Level_t VerboseLevel, Log_Region_t Region, const char * Text, ...)
{
  va_list variadic_args;

  va_start(variadic_args, Text);
  Log_Module_PrintWithArg(VerboseLevel, Region, Text, variadic_args);
  va_end(variadic_args);
}

/* USER CODE END LF */
